In [1]:
#### Packages 

## EDA 

# numpy 
# pandas
# matplot lib
# seaborn
# plotly

## ML

# sickrit learn

## DL

# Tensorflow
# keras
# pytorch


## NLP

# NLTK
# Scipy

## BERT

# transformers (huggingface)


# Genai

# langchain
# gemini ai

In [7]:
# create a data frame useng list


name = ["aysuhs","avisnah","akash"]
age  = [20,25,30]

import pandas as pd

pd.DataFrame()  # for empty data frame no column and rows

df = pd.DataFrame(name,age)
df

          0
20   aysuhs
25  avisnah
30    akash

In [3]:
df = pd.DataFrame(zip(name,age))
df

         0   1
0   aysuhs  20
1  avisnah  25
2    akash  30

In [4]:
marks = [49,78,94]
df = pd.DataFrame(zip(name,age,marks))
df

         0   1   2
0   aysuhs  20  49
1  avisnah  25  78
2    akash  30  94

In [5]:
df = pd.DataFrame(zip(name,age,marks),columns=["name","age","marks"])
df

      name  age  marks
0   aysuhs   20     49
1  avisnah   25     78
2    akash   30     94

In [6]:
height = [6.2,5.4,6.5]
cols = ["name","age","marks","heightt"]
df = pd.DataFrame(zip(name,age,marks,height),columns=cols)
df

      name  age  marks  heightt
0   aysuhs   20     49      6.2
1  avisnah   25     78      5.4
2    akash   30     94      6.5

In [7]:
## add new column

# if you want to add a new column you need to cehcl the no rpows a;ready existed data
# for example df has 3 rows 
# then u need to create a list has 3 rowss
# the euate to the data frame

In [8]:
jobs = ["DS","CA","DE"]
df["job"] = jobs
df

      name  age  marks  heightt job
0   aysuhs   20     49      6.2  DS
1  avisnah   25     78      5.4  CA
2    akash   30     94      6.5  DE

In [9]:
df["money"] = ["20k","30k","50K"]
df

      name  age  marks  heightt job money
0   aysuhs   20     49      6.2  DS   20k
1  avisnah   25     78      5.4  CA   30k
2    akash   30     94      6.5  DE   50K

In [10]:
# drop  a column
df = df.drop(labels="marks",axis=1)
df

      name  age  heightt job money
0   aysuhs   20      6.2  DS   20k
1  avisnah   25      5.4  CA   30k
2    akash   30      6.5  DE   50K

In [11]:
## Update 
df["money"] = ["29k","65k","59K"]
df

      name  age  heightt job money
0   aysuhs   20      6.2  DS   29k
1  avisnah   25      5.4  CA   65k
2    akash   30      6.5  DE   59K

In [12]:
# chnage the index
cols = ["name","age","marks","height"]
index = ["A","B","C"]
df = pd.DataFrame(zip(name,age,marks,height),index= index, columns=cols)
df

      name  age  marks  height
A   aysuhs   20     49     6.2
B  avisnah   25     78     5.4
C    akash   30     94     6.5

In [13]:
## shape

df.shape

(3, 4)

In [14]:
df

      name  age  marks  height
A   aysuhs   20     49     6.2
B  avisnah   25     78     5.4
C    akash   30     94     6.5

In [15]:
## drop column

# we need 3 params
# Cloumn name
# axix(0,1) columns =1 ,rows= 0
# Inplace  - drop columns menas modiying dataframe if you want save it to same variable inplace = True

df.drop("marks",axis=1,inplace=True)
df

      name  age  height
A   aysuhs   20     6.2
B  avisnah   25     5.4
C    akash   30     6.5

In [16]:
df.drop("age",axis=1,inplace=False)
df

      name  age  height
A   aysuhs   20     6.2
B  avisnah   25     5.4
C    akash   30     6.5

In [17]:
# height = [6.2,5.4,6.5]
cols = ["name","age","marks","height"]
df = pd.DataFrame(zip(name,age,marks,height),columns=cols)
df

      name  age  marks  height
0   aysuhs   20     49     6.2
1  avisnah   25     78     5.4
2    akash   30     94     6.5

In [18]:
df.drop(labels=["age","marks"],axis=1,inplace=True)
df

      name  height
0   aysuhs     6.2
1  avisnah     5.4
2    akash     6.5

In [19]:
# delete rows 
df.drop(labels=[0,1],axis=0,inplace=True)
df

    name  height
2  akash     6.5

In [20]:
cols = ["name","age","marks","height"]
df = pd.DataFrame(zip(name,age,marks,height),columns=cols)
df

      name  age  marks  height
0   aysuhs   20     49     6.2
1  avisnah   25     78     5.4
2    akash   30     94     6.5

In [21]:
## How to save in local the df

# df.to_csv('data.csv')
df.to_csv('data1.csv',index=False)

In [22]:
df.to_excel('dataXL.xlsx',index=False)

#### Class 2

In [23]:
pd.read_excel("dataXL.xlsx")

      name  age  marks  height
0   aysuhs   20     49     6.2
1  avisnah   25     78     5.4
2    akash   30     94     6.5